INSERT INTO sys_code_usergroup(c_usergroup_name)
    VALUES
      ('维修厂A'),('维修厂B'),('维修厂C'),
      ('代理群A'),('代理群B'),('代理群C'),
      ('社群A'),('社群B'),('社群C');

INSERT INTO sys_code_userrole(c_userrole_name, i_usergroup_key)
    VALUES
      ('维修厂A角色A1',1),('维修厂A角色A2',1),('维修厂A角色A3',1),
      ('维修厂B角色B1',2),('维修厂B角色B2',2),('维修厂B角色B3',2),
      ('维修厂C角色C1',3),('维修厂C角色C2',3),('维修厂C角色C3',3),

      ('代理群A角色A1',4),('代理群A角色A2',4),('代理群A角色A3',4),
      ('代理群B角色B1',5),('代理群B角色B2',5),('代理群B角色B3',5),
      ('代理群C角色C1',6),('代理群C角色C2',6),('代理群C角色C3',6),

      ('社群A角色A1',7),('社群A角色A2',7),('社群A角色A3',7),
      ('社群B角色B1',8),('社群B角色B2',8),('社群B角色B3',8),
      ('社群C角色C1',9),('社群C角色C2',9),('社群C角色C3',9);

INSERT INTO sys_code_user(c_user_name)
    VALUES
      ('赵一A'),('钱二B'),('孙三C'),('李四D'),('周五E'),('吴六F'),('郑七G'),('王王H'),
      ('赵一I'),('钱二J'),('孙三K'),('李四L'),('周五M'),('吴六N'),('郑七O'),('王王P'),
      ('赵一Q'),('钱二R'),('孙三S'),('李四T'),('周五U'),('吴六V'),('郑七W'),('王王X');